# Banking Project

***

>The bank wants to improve their services. For instance, the bank managers have only vague idea, who is a good client (whom to offer some additional services) and who is a bad client (whom to watch carefully to minimize the bank loses). Fortunately, the bank stores data about their clients, the accounts (transactions within several months), the loans already granted, the credit cards issued. The bank managers hope to improve their understanding of customers and seek specific actions to improve services. A mere application of a discovery tool will not be convincing for them.  

>To test a data mining approach to help the bank managers, it was decided to address two problems, a descriptive and a predictive one. While the descriptive problem was left open, the predictive problem is the prediction of whether a loan will end successfuly.

> _ - in Banking Case Description, ECAC Moodle Page_

***

[Kaggle Challenge Page](https://www.kaggle.com/)

## Tools

For this work we will use the common tools in a data scientist and engineer arsenal. All of them work together in a seamless fashion, as well as with the Jupyter Notebook (this enhanced interactive document).

* **Numpy** is the fundamental package for scientific computing with Python
* **Pandas** provides high-performance, easy-to-use data structures (_e.g._ data frames) and data analysis tools
* **Matplotlib** implements plotting functionality
* **Scikit Learn** aggregates advanced machine learning tools

In [1]:
import numpy as np
import pandas as pd
import matplotlib
import sklearn

## Data Cleaning

A key initial step in every data mining work is to clean the data. This reduces the occurence of future unexpected behaviors and gives a preliminary insight over the "raw" data.

In [30]:
transactions_df = pd.read_csv('./data/banking - transaction.csv', 
                              sep=';',
                              parse_dates=['date'],
                              infer_datetime_format=True,
                              dtype={'bank':np.str})

In [31]:
transactions_df.head()

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account
0,695247,2378,1993-01-01,credit,credit in cash,700,700,NaN,NaN,NaN
1,171812,576,1993-01-01,credit,credit in cash,900,900,NaN,NaN,NaN
2,207264,704,1993-01-01,credit,credit in cash,1000,1000,NaN,NaN,NaN
3,1117247,3818,1993-01-01,credit,credit in cash,600,600,NaN,NaN,NaN
4,579373,1972,1993-01-02,credit,credit in cash,400,400,NaN,NaN,NaN

In [32]:
accounts_df = pd.read_excel('./data/banking.xlsx', 
                            sheetname='account',
                            parse_dates=['date'],
                            infer_datetime_format=True,
                           )

In [33]:
accounts_df.head()

   account_id  district_id         frequency       date
0         576           55  monthly issuance 1993-01-01
1        3818           74  monthly issuance 1993-01-01
2         704           55  monthly issuance 1993-01-01
3        2378           16  monthly issuance 1993-01-01
4        2632           24  monthly issuance 1993-01-02

In [34]:
clients_df = pd.read_excel('./data/banking.xlsx',
                           sheetname='client')

In [35]:
clients_df.head()

   client_id  birth_number  district_id
0          1        706213           18
1          2        450204            1
2          3        406009            1
3          4        561201            5
4          5        605703            5

In [37]:
dispositions_df = pd.read_excel('./data/banking.xlsx',
                                sheetname='disposition')

In [39]:
dispositions_df.head()

   disp_id  client_id  account_id       type
0        1          1           1      OWNER
1        2          2           2      OWNER
2        3          3           2  DISPONENT
3        4          4           3      OWNER
4        5          5           3  DISPONENT

In [40]:
payment_orders_df = pd.read_excel('./data/banking.xlsx',
                                  sheetname='payment order')

In [41]:
payment_orders_df.head()

   order_id  account_id bank_to  account_to  amount   k_symbol
0     29401           1      YZ    87144583  2452.0  household
1     29402           2      ST    89597016  3372.7       loan
2     29403           2      QR    13943797  7266.0  household
3     29404           3      WX    83084338  1135.0  household
4     29405           3      CD    24485939   327.0        NaN

In [42]:
loans_df = pd.read_excel('./data/banking.xlsx',
                         sheetname='loan',
                         parse_dates=['date'],
                         infer_datetime_format=True)

In [43]:
loans_df.head()

   loan_id  account_id       date  amount  duration  payments status
0     5314        1787 1993-07-05   96396        12      8033      B
1     5316        1801 1993-07-11  165960        36      4610      A
2     6863        9188 1993-07-28  127080        60      2118      A
3     5325        1843 1993-08-03  105804        36      2939      A
4     7240       11013 1993-09-06  274740        60      4579      A

In [48]:
credit_cards_df = pd.read_excel('./data/banking.xlsx',
                                sheetname='credit card',
                                parse_dates=['issued'],
                                infer_datetime_format=True)

In [49]:
credit_cards_df.head()

   card_id  disp_id     type     issued
0     1005     9285  classic 1993-11-07
1      104      588  classic 1994-01-19
2      747     4915  classic 1994-02-05
3       70      439  classic 1994-02-08
4      577     3687  classic 1994-02-15

In [50]:
districts_df = pd.read_excel('./data/banking.xlsx',
                             sheetname='district')

In [51]:
districts_df.head()

,A1,A2,A3,A4,A5,A6,A7,A8,A9,A10,A11,A12,A13,A14,A15,A16
0,1,D1,R1,1204953,0,0,0,1,1,100.0,12541,0.29,0.43,167,85677,99107
1,2,D2,R2,88884,80,26,6,2,5,46.7,8507,1.67,1.85,132,2159,2674
2,3,D3,R2,75232,55,26,4,1,5,41.7,8980,1.95,2.21,111,2824,2813
3,4,D4,R2,149893,63,29,6,2,6,67.4,9753,4.64,5.05,109,5244,5892
4,5,D5,R2,95616,65,30,4,1,6,51.4,9307,3.85,4.43,118,2616,3040

## 1. Data description

This first section aims at providing ways to better understand and extract value from the data. This is mostly accoplished by gathering descriptive statistics and ploting.

In [27]:
transactions_df.describe()

,trans_id,account_id,amount,balance,account
count,1056320.000000,1056320.000000,1056320.000000,1056320.000000,295389.000000
mean,1335310.704330,2936.867290,5924.145676,38518.330803,45670919.374916
std,1227486.508382,2477.345127,9522.735373,22117.868013,30663396.851208
min,1.000000,1.000000,0.000000,-41125.700000,0.000000
25%,430262.750000,1204.000000,135.900000,22402.500000,17828584.000000
50%,858506.500000,2434.000000,2100.000000,33143.400000,45750951.000000
75%,2060979.250000,3660.000000,6800.000000,49603.625000,72013407.000000
max,3682987.000000,11382.000000,87400.000000,209637.000000,99994199.000000